Revit 2027 API
BuiltInFailures.SketchFailures.VarSketchFailure Property
 Constraints defined by highlighted Lines and Dimensions can't be satisfied.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId VarSketchFailure { get; }
Public Shared ReadOnly Property VarSketchFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ VarSketchFailure {
	FailureDefinitionId^ get ();
}
static member VarSketchFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace